# UnitType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationDimensionDefinition..::..UnitType Property
FabricationDimensionDefinition Class See Also
---
Fabrication dimension unit type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public FabricationDimensionUnitType UnitType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property UnitType As FabricationDimensionUnitType
	Get
```

Visual C++
---
```text
public:
property FabricationDimensionUnitType UnitType {
	FabricationDimensionUnitType get ();
}
```

# See Also
FabricationDimensionDefinition Class
Autodesk.Revit.DB Namespace